#include<cstdio> 
#include<iostream>
using namespace std;

/***********************************************************************/

int n,m[7];//					n为物品数量	 m为纸币张数				
int tl1,tl2;//					tl1为总钱数  tl2为总张数 
int t;//						t[]为每个物品的价值 
int ans_min;//					ans_min[]为最小货币张数 
int ans_max;//					ans_max[]为最大货币张数 
int mm[7];
int mon[7]={0,100,50,20,10,5,1};//打表 
int l[7]={0,5,10,25,50,100,500};//打表2 
int dp[7][500][8];//				小多重背包 

/*************************************************************************/

int main()/***愉***快***地***开***始***了***主***函***数***/
{
	//freopen("pay.in","r",stdin); 
	//freopen("pay.out","w",stdout);
	scanf("%d",&n);//				get 商品数量 
	for(int i=1;i<=6;i++)
		scanf("%d",&m[i]);//		get 货币数量 
	
/**********************************************************************************/	
	
	tl1=m[1]*100+m[2]*50+m[3]*20+m[4]*10+m[5]*5+m[6];
	//								计算总钱数 
	tl2=m[1]+m[2]+m[3]+m[4]+m[5]+m[6];
	//								计算总张数
	
	for(int i=1;i<=6;i++)//			初始化dp[][] 
		for(int j=1;j<=499;j++)
			dp[i][j][1]=100010;//		赋给最大值 
	for(int i=1;i<=6;i++)
		dp[i][0][1]=0; //				边界条件 
	
/******************************************************************************************/ 
					
	for(int i=1;i<=6;i++)//			背包 
		for(int j=1;j<=499;j++)
			for(int k=1;k<=min(499,l[i]);k++)
			{
				if(j>=k*mon[i])
				{
					dp[i][j][1]=min(dp[i-1][j][1],dp[i-1][j-k*mon[i]][1]+k);
					dp[i][j][2]=dp[i-1][j-k*mon[i]][2];
					dp[i][j][3]=dp[i-1][j-k*mon[i]][3];
					dp[i][j][4]=dp[i-1][j-k*mon[i]][4];
					dp[i][j][5]=dp[i-1][j-k*mon[i]][5];
					dp[i][j][6]=dp[i-1][j-k*mon[i]][6];
					dp[i][j][7]=dp[i-1][j-k*mon[i]][7];
					dp[i][j][i+1]+=k; 
				}
				else
				{
					dp[i][j][1]=dp[i-1][j][1];
					dp[i][j][2]=dp[i-1][j][2];
					dp[i][j][3]=dp[i-1][j][3];
					dp[i][j][4]=dp[i-1][j][4];
					dp[i][j][5]=dp[i-1][j][5];
					dp[i][j][6]=dp[i-1][j][6];
					dp[i][j][7]=dp[i-1][j][7];
				}
			}
					
/**************************************************************************************************/					
						
	for(int i=1;i<=n;i++)//			凑钱 
	{
		scanf("%d",&t);//		get 商品价格 
		if(t<=tl1&&dp[6][t%500][1]<=499)//钱够+刚好 
		{
			int a=t-t%500;//		最小值 
			int b=tl1-t-(tl1-t)%500;//最大值 
			
			
			ans_min=dp[6][t%500][1];//			先算零头 
			ans_min+=min(m[1],a/100);//		尽量多用100元 
			a=a-100*min(m[1],a/100); //		更新a值	
			ans_min+=min(m[2],a/50); //		尽量多用50元 
			a=a-50*min(m[2],a/50);//		更新a值
			ans_min+=min(m[3],a/20);//		尽量多用20元 
			a=a-20*min(m[3],a/20);//		更新a值
			ans_min+=min(m[4],a/10);//		尽量多用10元 
			a=a-10*min(m[4],a/10);//		更新a值
			ans_min+=min(m[5],a/5);//		尽量多用5元 
			a=a-5*min(m[5],a/5);//			更新a值
			ans_min+=min(m[6],a/1);//		尽量多用1元 
			a=a-1*min(m[6],a/1);//			更新a值
			
			ans_max=tl2-dp[6][(tl1-t)%500][1];//
			ans_max-=min(m[1],b/100);//
			b=b-100*min(m[1],b/100); //
			ans_max-=min(m[2],b/50);//
			b=b-50*min(m[2],b/50);//
			ans_max-=min(m[3],b/20);//
			b=b-20*min(m[3],b/20);//
			ans_max-=min(m[4],b/10);//
			b=b-10*min(m[4],b/10);//
			ans_max-=min(m[5],b/5);//
			b=b-5*min(m[5],b/5);//
			ans_max-=min(m[6],b/1);//
			b=b-1*min(m[6],b/1);//
		}
		printf("%d %d\n",ans_min,ans_max);
	}
	return 0;
}/***愉***快***的***结***束***了***主***函***数***/
